package block2.block55;

public class cikli {
    public static void main(String[] args) {

        // loop - цикл
        // существует 4 вида циклов

        // Операции увеличении

        int a = 10;
        //a = a+1; // или a+=1;
        // оператор инкремента;
        a++;

        // a= a -1 ;
        // a-=1;
        // Оператор дикримента
        a--;

        // ******   Цикл "Пока" WHILE
        // Задача вывести все числа от 1 до 1000 каждое с новой строки
        int i = 1;
        // выполнять цикл пока i меньше или равно 1000
        while (i <= 10) {
//            System.out.println(i);
            i++;
            //в любой момент мы можем прервать цикл через Break
            if (i == 5) {
                break;
            }
        }

        // Задача2
        // Вывести все четные числа от 1000 до 0;
        int q = 100;
        while (q >= 0) {
            q--;
            if (q % 2 == 0) {  // остаток от деления
                System.out.println("Значения q = " + q);
            }
        }

        // Задача3
        // Посчитать среднее арифметическое всех чисел от 0 до 100

        int sum = 0; // Переменная суммы чисел
        int count = 1; // количество чисел
        while (count <= 100) {  // каждую переменную прибавлять
            sum += count;
            count++;
        }
        float result = sum / (float) count; // результат среднего арифметического
        System.out.println(result);

        // *************  ЦИКЛ DO WHILE // Блок кода выполнится хотя бы один раз перед проверкой
        int w = 0;
        do {
            System.out.println("HELLO");
        } while (w > 0);


        // ********* ЦИКЛ FOR // цикл для использования, когда нужно выполнить операцию некоторое кол-во раз

        for (int z = 0; z < 10; z++) {
            System.out.println("Z равна = " + z);
        }

        // Пример
        for (int x = 100; x > 0; x--) {
            if (x % 3 == 0) {
                System.out.println("X = " + x);
            }
        }

        // Задача 3 //DZ
        // Вывести все нечетные числа от 100 до 1000, которые делятся без остатка на 5;

        for (int s = 10; s <= 100; s++) {
            if (s % 5 == 0) {
                if (s % 2 != 0) {
                    System.out.println("S равна " + s);
                }
            }
        }

    }
}




